Revit 2027 API
ReinforcementSettings.IsEqual Method
 Checks if Reinforcement Settings is equal to other
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	ReinforcementSettings other
)
Public Function IsEqual (
	other As ReinforcementSettings
) As Boolean
public:
bool IsEqual(
	ReinforcementSettings^ other
)
member IsEqual :
        other : ReinforcementSettings -> bool
Parameters
other ReinforcementSettings
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace